#+STARTUP: hidestars
#+TITLE:Lisp Evolution

One of the examples of the =loop= macro from Land of Lisp is an
evolution simulation... It will use =loop= to iterate through many
generations and allow our world to "evolve".

** Reproduction
Animal reproduction will occur in the simulation asexually, so
variance will exclusively be the result of mutation.

Reproduction can occur when an animal has a certain amount of energy,
and will halve their remaining energy.

#+BEGIN_SRC lisp :exports code :tangle yes
  (defparameter *reproduction-energy* 200)
#+END_SRC

#+RESULTS:
: *REPRODUCTION-ENERGY*

Below is the book's implementation of the reproduction function for
the sim:
#+BEGIN_SRC lisp :exports code :tangle yes
  (defun reproduce (animal)
    (let ((e (animal-energy animal)))
      (when (>= e *reproduction-energy*)
        (setf (animal-energy animal) (ash e -1))
        (let ((animal-nu (copy-structure animal))
              (genes (copy-list (animal-genes animal)))
              (mutation (random 8)))
          (setf (nth mutation genes) (max 1 (+ (nth mutation genes) (random 3) -1)))
          (setf (animal-genes animal-nu) genes)
          (push animal-nu *animals*)))))
#+END_SRC

#+RESULTS:
: REPRODUCE

=copy-structure= creates a brand new struct based on the struct passed
in, using a shallow copy and after that, we mutate a single gene by
-1, 0, or +1, assign the new genes to the copied animal struct, and
push the struct to our =*animals*= list.

*Note:* In a shallow copy, basic values like numbers and symbols are
created anew in the new struct, but complex values like other
structures and lists are shared with the parent. So modifying a list
in the copied struct will modify the parent as well:

#+BEGIN_SRC lisp :exports both
  (let ((a (make-animal)))
    (setf (animal-genes a) '(1 2 3 4))
    (let ((b (copy-structure a)))
      (setf (car (animal-genes b)) 7590)
      (animal-genes a)))
#+END_SRC

#+RESULTS:
| 7590 | 2 | 3 | 4 |

So, not good in this case.

Anywho, now that we have all of the functions to update animals in our
world, we can now start working on updating our world!

